tutorials/XiFluid/engine2Valve2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentKineticEnergy];

internalField   uniform     0.23;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inletFuel
    {
        type            turbulentKineticEnergy;
        intensity       0.05;
        value           $internalField;
    }

    inlet
    {
        type            turbulentKineticEnergy;
        intensity       0.05;
        value           $internalField;
    }

    outlet
    {
        type            turbulentKineticEnergy;
        intensity       0.05;
        value           $internalField;
    }

    piston
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    liner
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    cylinderHead
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    ivHead
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    ivStem
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    evHead
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    evStem
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }

    "nonCouple.*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
